#### Execute following instractions before run the code  
# 1. `QGIS`を開く
# 2. `01_data/raw/geometry_shapefiles/N05-22_GML/N05-22_Station2.shp`と`01_data/raw/geometry_data/shape_files/N03-190101_GML/N03-19_190101.shp`をQGISにドラック&ドロップ
# 3. Vector -> Geoproccessing Tools -> Interactionからデータを合わせる。
# 4. InteractionされたレイヤーをExport -> csvから、`01_data/raw/geometry_data/geometry_base.csv`という名前で保存。

main <- function() {

    # read station and municipality data
    df_geometry <- read_geometry_data()

    line_control <- readxl::read_xlsx(here::here("01_data", "raw", "station_data", "control.xlsx")) |>
        dplyr::distinct(line_name) |>
        dplyr::pull()

    line_treatment <- readxl::read_xlsx(here::here("01_data", "raw", "station_data", "treatment.xlsx")) |>
        dplyr::filter(
            !year >= 2020,
            line_name != "〃"
            ) |>
        dplyr::distinct(line_name) |>
        dplyr::pull() 

    df_treatment <- df_geometry |>
        dplyr::filter(line_name %in% line_treatment)

    df_control <- df_geometry |>
        dplyr::filter(line_name %in% line_control)

}

read_geometry_data <- function() {

    df_geometry <- read.csv(here::here("01_data", "raw", "geometry_data", "geometry_base.csv"), encoding = "co932") |> 
        dplyr::select(
            "line_name" = N05_002,
            "company_name" = N05_003,
            "year_start"   = N05_005b,
            "year_end"     = N05_005e,
            "station_name" = N05_011,
            "prefecture_name" = N03_001,
            "city_id" = N03_007
        )
}


read_ordinance_designated_city <- function() {

    df_ordinance_designated_area <- dplyr::tribble(
        ~city_id, ~city_name,
        01100, "札幌市",
        01101, "札幌市 中央区",
        01102, "札幌市 北区",
        01103, "札幌市 東区",
        01104, "札幌市 白石区",
        01105, "札幌市 豊平区",
        01106, "札幌市 南区",
        01107, "札幌市 西区",
        01108, "札幌市 厚別区",
        01109, "札幌市 手稲区",
        01110, "札幌市 清田区",
        27100, "大阪市",
        27102, "大阪市 都島区",
        27103, "大阪市 福島区",
        27104, "大阪市 此花区",
        27106, "大阪市 西区",
        27107, "大阪市 港区",
        27108, "大阪市 大正区",
        27109, "大阪市 天王寺区",
        27111, "大阪市 浪速区",
        27113, "大阪市 西淀川区",
        27114, "大阪市 東淀川区",
        27115, "大阪市 東成区",
        27116, "大阪市 生野区",
        27117, "大阪市 旭区",
        27118, "大阪市 城東区",
        27119, "大阪市 阿倍野区",
        27120, "大阪市 住吉区",
        27121, "大阪市 東住吉区",
        27122, "大阪市 西成区",
        27123, "大阪市 淀川区",
        27124, "大阪市 鶴見区",
        27125, "大阪市 住之江区",
        27126, "大阪市 平野区",
        27127, "大阪市 北区",
        27128, "大阪市 中央区",
        27140, "堺市",
        27141, "堺市 堺区",
        27142, "堺市 中区",
        27143, "堺市 東区",
        27144, "堺市 西区",
        27145, "堺市 南区",
        27146, "堺市 北区",
        27147, "堺市 美原区",
        23100, "名古屋市",
        23101, "名古屋市 千種区",
        23102, "名古屋市 東区",
        23103, "名古屋市 北区",
        23104, "名古屋市 西区",
        23105, "名古屋市 中村区",
        23106, "名古屋市 中区",
        23107, "名古屋市 昭和区",
        23108, "名古屋市 瑞穂区",
        23109, "名古屋市 熱田区",
        23110, "名古屋市 中川区",
        23111, "名古屋市 港区",
        23112, "名古屋市 南区",
        23113, "名古屋市 守山区",
        23114, "名古屋市 緑区",
        23115, "名古屋市 名東区",
        23116, "名古屋市 天白区",
        26100, "京都市",
        26101, "京都市 北区",
        26102, "京都市 上京区",
        26103, "京都市 左京区",
        26104, "京都市 中京区",
        26105, "京都市 東山区",
        26106, "京都市 下京区",
        26107, "京都市 南区",
        26108, "京都市 右京区",
        26109, "京都市 伏見区",
        26110, "京都市 山科区",
        26111, "京都市 西京区",
        14100, "横浜市",
        14101, "横浜市 鶴見区",
        14102, "横浜市 神奈川区",
        14103, "横浜市 西区",
        14104, "横浜市 中区",
        14105, "横浜市 南区",
        14106, "横浜市 保土ケ谷区",
        14107, "横浜市 磯子区",
        14108, "横浜市 金沢区",
        14109, "横浜市 港北区",
        14110, "横浜市 戸塚区",
        14111, "横浜市 港南区",
        14112, "横浜市 旭区",
        14113, "横浜市 緑区",
        14114, "横浜市 瀬谷区",
        14115, "横浜市 栄区",
        14116, "横浜市 泉区",
        14117, "横浜市 青葉区",
        14118, "横浜市 都筑区",
        14130, "川崎市",
        14131, "川崎市 川崎区",
        14132, "川崎市 幸区",
        14133, "川崎市 中原区",
        14134, "川崎市 高津区",
        14135, "川崎市 多摩区",
        14136, "川崎市 宮前区",
        14137, "川崎市 麻生区",
        14150, "相模原市",
        14151, "相模原市 緑区",
        14152, "相模原市 中央区",
        14153, "相模原市 南区",
        28100, "神戸市",
        28101, "神戸市 東灘区",
        28102, "神戸市 灘区",
        28105, "神戸市 兵庫区",
        28106, "神戸市 長田区",
        28107, "神戸市 須磨区",
        28108, "神戸市 垂水区",
        28109, "神戸市 北区",
        28110, "神戸市 中央区",
        28111, "神戸市 西区",
        40100, "北九州市",
        40101, "北九州市 門司区",
        40103, "北九州市 若松区",
        40105, "北九州市 戸畑区",
        40106, "北九州市 小倉北区",
        40107, "北九州市 小倉南区",
        40108, "北九州市 八幡東区",
        40109, "北九州市 八幡西区",
        40130, "福岡市",
        40131, "福岡市 東区",
        40132, "福岡市 博多区",
        40133, "福岡市 中央区",
        40134, "福岡市 南区",
        40135, "福岡市 西区",
        40136, "福岡市 城南区",
        40137, "福岡市 早良区",
        34100, "広島市",
        34101, "広島市 中区",
        34102, "広島市 東区",
        34103, "広島市 南区",
        34104, "広島市 西区",
        34105, "広島市 安佐南区",
        34106, "広島市 安佐北区",
        34107, "広島市 安芸区",
        34108, "広島市 佐伯区",
        04100, "仙台市",
        04101, "仙台市 青葉区",
        04102, "仙台市 宮城野区",
        04103, "仙台市 若林区",
        04104, "仙台市 太白区",
        04105, "仙台市 泉区",
        12100, "千葉市",
        12101, "千葉市 中央区",
        12102, "千葉市 花見川区",
        12103, "千葉市 稲毛区",
        12104, "千葉市 若葉区",
        12105, "千葉市 緑区",
        12106, "千葉市 美浜区",
        11100, "さいたま市",
        11101, "さいたま市 西区",
        11102, "さいたま市 北区",
        11103, "さいたま市 大宮区",
        11104, "さいたま市 見沼区",
        11105, "さいたま市 中央区",
        11106, "さいたま市 桜区",
        11107, "さいたま市 浦和区",
        11108, "さいたま市 南区",
        11109, "さいたま市 緑区",
        11110, "さいたま市 岩槻区",
        22100, "静岡市",
        22101, "静岡市 葵区",
        22102, "静岡市 駿河区",
        22103, "静岡市 清水区",
        22130, "浜松市",
        22131, "浜松市 中区",
        22132, "浜松市 東区",
        22133, "浜松市 西区",
        22134, "浜松市 南区",
        22135, "浜松市 北区",
        22136, "浜松市 浜北区",
        22137, "浜松市 天竜区",
        15100, "新潟市",
        15101, "新潟市 北区",
        15102, "新潟市 東区",
        15103, "新潟市 中央区",
        15104, "新潟市 江南区",
        15105, "新潟市 秋葉区",
        15106, "新潟市 南区",
        15107, "新潟市 西区",
        15108, "新潟市 西蒲区",
        33100, "岡山市",
        33101, "岡山市 北区",
        33102, "岡山市 中区",
        33103, "岡山市 東区",
        33104, "岡山市 南区",
        43100, "熊本市",
        43101, "熊本市 中央区",
        43102, "熊本市 東区",
        43103, "熊本市 西区",
        43104, "熊本市 南区",
        43105, "熊本市 北区",
        ) |>
    tidyr::separate(
        col = city_name,
        into = c("city_name", "city_name_small"),
        sep = " "
    ) |> 
    dplyr::mutate(
        city_name_small = if_else(
            !is.na(city_name_small),
            paste0(city_name, city_name_small),
            city_name_small)
    ) |>
    dplyr::mutate(
        city_id_adjust = if_else(
            is.na(city_name_small),
            city_id,
            NA
        )
    ) |> 
    tidyr::fill(city_id_adjust)

    return(df_ordinance_designated_area)
}
